# Worldwide Sales Statistics

Universal Motorcycles (UM) is a global motorcycle brand. All motorcycle models sold by UM and their prices are present in the *motorcycle_model* table. The countries in which these motorcycles are sold are present in the *country* table. The UM team maintains all the country-wise sale records of its motorcycles in the *sales* table, storing the quantity sold on a particular date. Write a query that calculates country-wise sales for all of the motorcycle models along with the revenue generated for the year 2018. The order of output does not matter. The results should be in the following format: *country_name* | *motorcycle_model* | *revenue*

`DataFrames: motorcycle_model, country, sales`

- **motorcycle_model**
|Name|Type|
|---|---|
|id|INTEGER|
|name|STRING|
|price|INTEGER|

- **country**
|Name|Type|
|---|---|
|id|INTEGER|
|name|STRING|

- **sales**
|Name|Type|
|---|---|
|model_id|INTEGER|
|country_id|INTEGER|
|quantity|INTEGER|
|sales_date|TIMESTAMP|

## Sample Data

In [2]:
import pandas as pd
motorcycle_model = pd.read_csv("./data/motorcycle_model.csv")
country = pd.read_csv("./data/country.csv")
sales = pd.read_csv("./data/sales.csv")

In [4]:
motorcycle_model

   id     name  price
0   1  MOTO400  50000
1   2  YZM1000  70000

In [5]:
country

   id                   name
0   1               Dominica
1   2                Algeria
2   3  Sao Tome and Principe

In [6]:
sales

   model_id  country_id  quantity  sales_date
0         2           3         4  2018-01-29
1         2           1         2  2018-01-19
2         2           1         2  2017-12-20
3         1           2         1  2017-12-18
4         1           3         5  2017-12-10
5         1           2         5  2017-12-17
6         1           1         5  2018-01-10
7         2           3         4  2018-01-01
8         2           2         3  2017-12-24
9         2           1         4  2017-12-14

## Screenshot of original question

<img src = "./images/task.jpeg">

<img src = "./images/sample_data.jpeg">

---